Revit 2026 API

# ShapeImporterSetDefaultLengthUnit Method

---

Sets the length unit to be used when the input is a unitless SAT file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ShapeImporter SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
```
```vb
Public Function SetDefaultLengthUnit (
	defaultLengthUnit As ImportUnit
) As ShapeImporter
```
```cpp
public:
ShapeImporter^ SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
```
```fsharp
member SetDefaultLengthUnit :
        defaultLengthUnit : ImportUnit -> ShapeImporter
```

#### Parameters

defaultLengthUnit ImportUnit
     The length unit to be used for when the input is a unitless SAT file.

#### Return Value

ShapeImporter

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Values ImportUnit::Default and ImportUnit::Custom are ignored. ImportUnit::Centimeter is used instead.

#### Reference

ShapeImporter Class

Autodesk.Revit.DB Namespace